/**************************************1108 - IP 地址无效化*************************************

给你一个有效的 IPv4 地址 address，返回这个 IP 地址的无效化版本。

所谓无效化 IP 地址，其实就是用 "[.]" 代替了每个 "."。



示例 1：

输入：address = "1.1.1.1"
输出："1[.]1[.]1[.]1"
示例 2：

输入：address = "255.100.50.0"
输出："255[.]100[.]50[.]0"


提示：

给出的 address 是一个有效的 IPv4 地址
*****************************************************************************************************/

//扫描字符串，遇到'.'就替换成'['，并在后面插入".]"

//注意此时字符串长度和循环变量都需要发生变化

class Solution {
public:
    string defangIPaddr(string address) {
        int len = address.length();
        for (int i = 0; i < len; i++)
        {
            if (address[i] == '.')
            {
                address[i] = '[';
                address.insert(i + 1, ".]");
                i = i + 2;
                len = len + 2;
            }
        }
        return address;
    }
};
