/**************************************504 - 七进制数*************************************

给定一个整数，将其转化为7进制，并以字符串形式输出。

示例 1:

输入: 100
输出: "202"

示例 2:

输入: -7
输出: "-10"

注意: 输入范围是 [-1e7, 1e7] 。
*****************************************************************************************************/

//进制转换固定流程，注意不要把0漏了

class Solution {
public:
    string convertToBase7(int num) {
        if (num == 0)
            return "0";
        bool neg = num < 0 ? true : false;
        num = abs(num);
        string ans;
        while (num)
        {
            ans.insert(0, 1, (char)(num % 7 + 48));
            num = num / 7;
        }
        if (neg)
            ans.insert(0, 1, '-');
        return ans;
    }
};
