/**************************************905 - 按奇偶排序数组*************************************

给定一个非负整数数组 A，返回一个数组，在该数组中， A 的所有偶数元素之后跟着所有奇数元素。

你可以返回满足此条件的任何数组作为答案。



示例：

输入：[3,1,2,4]
输出：[2,4,3,1]
输出 [4,2,3,1]，[2,4,1,3] 和 [4,2,1,3] 也会被接受。


提示：

1 <= A.length <= 5000
0 <= A[i] <= 5000
*****************************************************************************************************/

//双指针问题，双指针分别指向首尾，遍历向量，偶数插入结果向量首，奇数插入结果向量尾

class Solution {
public:
    vector<int> sortArrayByParity(vector<int>& A) {
        int len = A.size();
        int start = 0;
        int finish = len - 1;
        vector<int> ans(len);
        for (int i = 0; i < len; i++)
        {
            if (A[i] % 2)
                ans[finish--] = A[i];
            else
                ans[start++] = A[i];
        }
        return ans;
    }
};
